## Plan for gcp/bootstrap
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 0 to change, 19 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_organization_iam_member.tf_sa_org_perms["roles/accesscontextmanager.policyReader"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/accesscontextmanager.policyReader/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/accesscontextmanager.policyReader" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/billing.viewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/billing.viewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/billing.viewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/compute.networkViewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/compute.networkViewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/compute.networkViewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/iam.securityReviewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/iam.securityReviewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/iam.securityReviewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/iam.serviceAccountViewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/iam.serviceAccountViewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/iam.serviceAccountViewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/iam.workloadIdentityPoolViewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/iam.workloadIdentityPoolViewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/iam.workloadIdentityPoolViewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/logging.viewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/logging.viewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/logging.viewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/orgpolicy.policyViewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/orgpolicy.policyViewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/orgpolicy.policyViewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/resourcemanager.folderViewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/resourcemanager.folderViewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/resourcemanager.folderViewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/resourcemanager.organizationViewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/resourcemanager.organizationViewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/resourcemanager.organizationViewer" -> null
    }

  # google_organization_iam_member.tf_sa_org_perms["roles/securitycenter.adminViewer"] will be destroyed
  # (because google_organization_iam_member.tf_sa_org_perms is not in configuration)
  - resource "google_organization_iam_member" "tf_sa_org_perms" {
      - etag   = "BwXbpAVotOs=" -> null
      - id     = "775533309665/roles/securitycenter.adminViewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - org_id = "775533309665" -> null
      - role   = "roles/securitycenter.adminViewer" -> null
    }

  # module.gh_oidc.google_iam_workload_identity_pool.main must be replaced
-/+ resource "google_iam_workload_identity_pool" "main" {
      ~ id                        = "projects/tf-seed-1dc6/locations/global/workloadIdentityPools/tf-seed-production-enviorment" -> (known after apply)
      ~ name                      = "projects/964745148353/locations/global/workloadIdentityPools/tf-seed-production-enviorment" -> (known after apply)
      ~ state                     = "ACTIVE" -> (known after apply)
      ~ workload_identity_pool_id = "tf-seed-production-enviorment" -> "tf-seed" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.gh_oidc.google_iam_workload_identity_pool_provider.main must be replaced
-/+ resource "google_iam_workload_identity_pool_provider" "main" {
      - attribute_condition                = "attribute.environment==\"production\"" -> null
      ~ attribute_mapping                  = {
          - "attribute.environment" = "assertion.environment" -> null
            # (4 unchanged elements hidden)
        }
      - disabled                           = false -> null
      ~ id                                 = "projects/tf-seed-1dc6/locations/global/workloadIdentityPools/tf-seed-production-enviorment/providers/tf-seed-production-enviorment" -> (known after apply)
      ~ name                               = "projects/964745148353/locations/global/workloadIdentityPools/tf-seed-production-enviorment/providers/tf-seed-production-enviorment" -> (known after apply)
      ~ state                              = "ACTIVE" -> (known after apply)
      ~ workload_identity_pool_id          = "tf-seed-production-enviorment" -> "tf-seed" # forces replacement
      ~ workload_identity_pool_provider_id = "tf-seed-production-enviorment" -> "tf-seed" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gh_oidc.google_service_account_iam_member.wif-sa["tf-seed"] must be replaced
-/+ resource "google_service_account_iam_member" "wif-sa" {
      ~ etag               = "BwXboz0k3YA=" -> (known after apply)
      ~ id                 = "projects/tf-seed-1dc6/serviceAccounts/org-terraform@tf-seed-1dc6.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/964745148353/locations/global/workloadIdentityPools/tf-seed-production-enviorment/attribute.repository/anthr76/infra" -> (known after apply)
      ~ member             = "principalSet://iam.googleapis.com/projects/964745148353/locations/global/workloadIdentityPools/tf-seed-production-enviorment/attribute.repository/anthr76/infra" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.gh_oidc_pr.google_iam_workload_identity_pool.main will be destroyed
  # (because google_iam_workload_identity_pool.main is not in configuration)
  - resource "google_iam_workload_identity_pool" "main" {
      - description               = "Workload Identity Pool managed by Terraform" -> null
      - disabled                  = false -> null
      - id                        = "projects/tf-seed-1dc6/locations/global/workloadIdentityPools/tf-seed-pr" -> null
      - name                      = "projects/964745148353/locations/global/workloadIdentityPools/tf-seed-pr" -> null
      - project                   = "tf-seed-1dc6" -> null
      - state                     = "ACTIVE" -> null
      - workload_identity_pool_id = "tf-seed-pr" -> null
    }

  # module.gh_oidc_pr.google_iam_workload_identity_pool_provider.main will be destroyed
  # (because google_iam_workload_identity_pool_provider.main is not in configuration)
  - resource "google_iam_workload_identity_pool_provider" "main" {
      - attribute_mapping                  = {
          - "attribute.actor"      = "assertion.actor"
          - "attribute.aud"        = "assertion.aud"
          - "attribute.repository" = "assertion.repository"
          - "google.subject"       = "assertion.sub"
        } -> null
      - description                        = "Workload Identity Pool Provider managed by Terraform" -> null
      - disabled                           = false -> null
      - id                                 = "projects/tf-seed-1dc6/locations/global/workloadIdentityPools/tf-seed-pr/providers/tf-seed-pr" -> null
      - name                               = "projects/964745148353/locations/global/workloadIdentityPools/tf-seed-pr/providers/tf-seed-pr" -> null
      - project                            = "tf-seed-1dc6" -> null
      - state                              = "ACTIVE" -> null
      - workload_identity_pool_id          = "tf-seed-pr" -> null
      - workload_identity_pool_provider_id = "tf-seed-pr" -> null

      - oidc {
          - allowed_audiences = [] -> null
          - issuer_uri        = "https://token.actions.githubusercontent.com" -> null
        }
    }

  # module.gh_oidc_pr.google_service_account_iam_member.wif-sa["tf-seed"] will be destroyed
  # (because google_service_account_iam_member.wif-sa is not in configuration)
  - resource "google_service_account_iam_member" "wif-sa" {
      - etag               = "BwXbpAWqoLQ=" -> null
      - id                 = "projects/tf-seed-1dc6/serviceAccounts/tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/964745148353/locations/global/workloadIdentityPools/tf-seed-pr/attribute.repository/anthr76/infra" -> null
      - member             = "principalSet://iam.googleapis.com/projects/964745148353/locations/global/workloadIdentityPools/tf-seed-pr/attribute.repository/anthr76/infra" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/tf-seed-1dc6/serviceAccounts/tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
    }

  # module.sa_tf_seed_ro.google_project_iam_member.project-roles["tf-seed-viewer-tf-seed-1dc6=>roles/viewer"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwXbpAMRzLQ=" -> null
      - id      = "tf-seed-1dc6/roles/viewer/serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - project = "tf-seed-1dc6" -> null
      - role    = "roles/viewer" -> null
    }

  # module.sa_tf_seed_ro.google_service_account.service_accounts["tf-seed-viewer"] will be destroyed
  # (because google_service_account.service_accounts is not in configuration)
  - resource "google_service_account" "service_accounts" {
      - account_id   = "tf-seed-viewer" -> null
      - disabled     = false -> null
      - display_name = "Terraform-managed service account" -> null
      - email        = "tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - id           = "projects/tf-seed-1dc6/serviceAccounts/tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - name         = "projects/tf-seed-1dc6/serviceAccounts/tf-seed-viewer@tf-seed-1dc6.iam.gserviceaccount.com" -> null
      - project      = "tf-seed-1dc6" -> null
      - unique_id    = "109590833301088255558" -> null
    }

Plan: 3 to add, 0 to change, 19 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
/bin/sh: 1: conftest: not found

```

</details>
